var data = {
      "movies": [{
           "title": "Inherent Vice",
           "movieID": 002,
           "genre": "Comedy",
           "year": 2014,
           "length": 148 ,
           "image": "img/inherentvice.jpg",
           "actors": "Joaquin Phoenix, Josh Brolin, Owen Wilson",
           "teaser": "In 1970, drug-fueled Los Angeles private investigator Larry Doc Sportello investigates the disappearance of a former girlfriend.",
           "desc": "During the psychedelic 60s and 70s Larry Doc Sportello is surprised by his former girlfriend and her plot for her billionaire boyfriend, his wife, and her boyfriend. A plan for kidnapping gets shaken up by the oddball characters entangled in this groovy kidnapping romp based upon the novel by Thomas Pynchon.",
           "oscars": 0,
           "likes": 12,
           "dislikes": 6
      }, {
           "title": "The Master",
           "movieID": 003,
           "genre": "Drama",
           "year": 2012,
           "length": 138,
           "image":"img/themaster.jpg",
           "actors": "Philip Seymour Hoffman, Joaquin Phoenix, Amy Adams",
           "teaser": "A Naval veteran arrives home from war unsettled and uncertain of his future - until he is tantalized by The Cause and its charismatic leader.",
           "desc": "Returning from Navy service in World War II, Freddie Quell drifts through a series of breakdowns. Finally he stumbles upon a cult which engages in exercises to clear emotions and he becomes deeply involved with them.",
           "oscars":0,
           "likes": 76,
           "dislikes": 16
      }, {
           "title":"Phantom Thread",
           "movieID": 001,
           "genre": "Drama",
           "year": 2017,
           "length": 130,
           "image":"img/phantomthread.jpg",
           "actors": "Vicky Krieps, Daniel Day-Lewis, Lesley Manville",
           "teaser": "Set in 1950's London, Reynolds Woodcock is a renowned dressmaker whose fastidious life is disrupted by a young, strong-willed woman.",
           "desc": "Set in the glamour of 1950s post-war London, renowned dressmaker Reynolds Woodcock (Daniel Day-Lewis) and his sister Cyril (Lesley Manville) are at the center of British fashion, dressing royalty, movie stars, heiresses, socialites, debutants, and dames with the distinct style of The House of Woodcock. Women come and go through Woodcock's life, providing the confirmed bachelor with inspiration and companionship, until he comes across a young, strong-willed woma.",
           "oscars": 1,
           "likes": 23,
           "dislikes": 6
      }, {
           "title":"Punch-Drunk Love",
           "movieID": 005,
           "genre": "Comedy",
           "year": 2002,
           "length": 95,
           "image":"img/punchdrunk.jpg",
           "actors": "Adam Sandler, Emily Watson, Philip Seymour Hoffman",
           "teaser": "An epic mosaic of interrelated characters in search of love, forgiveness, and meaning in the San Fernando Valley.",
           "desc": "Barry Egan hates himself and hates his life. The only male among eight siblings, Barry is treated poorly by his overbearing sisters. Despite owning his own business, he has gotten nowhere in life largely because of his insecurities. He leads a solitary life, which allows him to hide his violent outbursts that occur when he's frustrated. His solitude however allows him to think, he stumbling upon a scheme to travel the world on a pittance, travel which he has never done. Concurrently, he meets two people who pull him in two different directions. The first is Lena Leonard, a friend of his sister Elizabeth. Barry is slow to realize that Lena is attracted to him, he making her make all the first moves. Lena is eventually able to get Barry out of his shell, she who sticks around despite his obvious problems. His burgeoning relationship and thus new life with Lena is threatened by the second, Georgia, who he contacted in an effort to alleviate his loneliness. Georgia and her band of brothers do whatever they can get get out of Barry what they want, no matter the price to Barry.",
           "oscars": 0,
           "likes": 56,
           "dislikes": 2
      }, {
           "title":"Magnolia",
           "movieID": 006,
           "genre": "Drama",
           "year": 1999,
           "length": 188,
           "image":"img/magnolia.jpg",
           "actors": "Tom Cruise, Jason Robards, Julianne Moore",
           "teaser": "Set in 1950's London, Reynolds Woodcock is a renowned dressmaker whose fastidious life is disrupted by a young, strong-willed woman.",
           "desc": "24 hours in L.A.; it's raining cats and dogs. Two parallel and intercut stories dramatize men about to die: both are estranged from a grown child, both want to make contact, and neither child wants anything to do with dad. Earl Partridge's son is a charismatic misogynist; Jimmy Gator's daughter is a cokehead and waif. A mild and caring nurse intercedes for Earl, reaching the son; a prayerful and upright beat cop meets the daughter, is attracted to her, and leads her toward a new calm. Meanwhile, guilt consumes Earl's young wife, while two whiz kids, one grown and a loser and the other young and pressured, face their situations. The weather, too, is quirky.",
           "oscars": 0,
           "likes": 59,
           "dislikes": 12
      }, {
           "title":"Boogie Nights",
           "movieID": 007,
           "genre": "Drama",
           "year": 1997,
           "length": 155,
           "image":"img/boogienights.jpg",
           "actors": "Mark Wahlberg, Julianne Moore, Burt Reynolds ",
           "teaser": "The story of a young man's adventures in the Californian pornography industry of the late 1970s and early 1980s.",
           "desc": "Adult film director Jack Horner is always on the lookout for new talent and it's only by chance that he meets Eddie Adams who is working as a busboy in a restaurant. Eddie is young, good looking and plenty of libido to spare. Using the screen name Dirk Diggler, he quickly rises to the top of his industry winning awards year after year. Drugs and ego however come between Dirk and those around him and he soon finds that fame is fleeting.",
           "oscars": 0,
           "likes": 84,
           "dislikes": 15
      }, {
           "title":"Last Exit Reno",
           "movieID": 008,
           "genre": "Drama",
           "year": 2017,
           "length": 102,
           "image":"img/lastexitreno.jpg",
           "actors": "Philip Baker Hall, John C. Reilly, Gwyneth Paltrow",
           "teaser": "Professional gambler Sydney teaches John the tricks of the trade. John does well until he falls for cocktail waitress Clementine.",
           "desc": "John has lost all his money. He sits outside a diner in the desert when Sydney happens along, buys him coffee, then takes him to Reno and shows him how to get a free room without losing much money. Under Sydney's fatherly tutelage, John becomes a successful small-time professional gambler, and all is well, until he falls for Clementine, a cocktail waitress and sometimes hooker.",
           "oscars": 0,
           "likes": 12,
           "dislikes": 2
      }, {
           "title":"Junun",
           "movieID": 009,
           "genre": "Documentary",
           "year": 2015,
           "length": 54,
           "image":"img/junun.jpg",
           "actors": "Ehtisham Khan Ajmeri, Nihal Khan, Nathu Lal Solanki",
           "teaser": "Musician Jonny Greenwood travels to Rajasthan, where he performs with a multitude of Indian musicians.",
           "desc": "Musician Jonny Greenwood travels to Rajasthan, where he performs with a multitude of Indian musicians.",
           "oscars": 0,
           "likes": 93,
           "dislikes": 2
      }, {
           "title":"Back Beyond",
           "movieID": 010,
           "genre": "Documentary",
           "year": 2013,
           "length": 20,
           "image":"img/backbeyond.jpg",
           "actors": "Amy Adams, Laura Dern, Philip Seymour Hoffman",
           "teaser": "A montage of unused scenes, shots and takes from P. T. Anderson's masterwork the Master.",
           "desc": "A montage of unused scenes, shots and takes from P. T. Anderson's masterwork the Master.",
           "oscars": 0,
           "likes": 21,
           "dislikes": 1
      }, {
           "title": "There Will Be Blood",
           "movieID": 004,
           "genre": "Drama",
           "year": 2007,
           "length": 158,
           "image":"img/therewillbeblood.jpg",
           "actors": "Daniel Day-Lewis, Paul Dano, Ciarán Hinds",
           "teaser": "A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business.",
           "desc": "The intersecting life stories of Daniel Plainview and Eli Sunday in early twentieth century California presents miner-turned-oilman Daniel Plainview, a driven man who will do whatever it takes to achieve his goals. He works hard but also takes advantage of those around him at their expense if need be. His business partner/son (H.W.) is, in reality, an acquired child whose true biological single-parent father (working on one of Daniel's rigs) died in a workplace accident. Daniel is deeply protective of H.W. if only for what H.W. brings to the partnership. Eli Sunday is one in a pair of twins whose family farm Daniel purchases for the major oil deposit located on it. Eli, a local preacher and a self-proclaimed faith healer, wants the money from the sale of the property to finance his own church. The lives of the two competitive men often clash as Daniel pumps oil off the property and tries to acquire all the surrounding land at bargain prices to be able to build a pipeline to the coast, and as Eli tries to build his own religious empire.",
           "oscars":2,
           "likes": 67,
           "dislikes": 4
      }]
   }
